Repository: necrose99/Myaamia
Catalog: ilda_full.tmx
Source language: mia
Languages: en_us

source: piiwi-
en_us: feather (generic), small feather

source: pikolakitimin-
en_us: Wild rose hip, prairie rose, climbing rose (Rosa setigera)

source: pikolakitimiš-
en_us: Wild rose bush, prairie rose, climbing rose (Rosa setigera)

source: pilaanti-
en_us: Baby bird

source: pilakiihiweekaan-
en_us: Hospital

source: pilakiihiwi-
en_us: Nurse, doctor, medical professional

source: pilakion-
en_us: Health

source: pileehsi-
en_us: Raven (Corvus corax)

source: pileelikw-
en_us: Flying squirrel (Glaucomys spp.)

source: pileens-
en_us: Chick, baby chicken

source: pileew-
en_us: Chicken (general term)

source: pileewa akiišikom-
en_us: Turkey Day (Thanksgiving)

source: pileewaankan-
en_us: Turkey Feather

source: piloohsa apineens-
en_us: Crib

source: piloohseens-
en_us: Infant, baby

source: piloohsikaan-
en_us: Nursery

source: pilow-
en_us: Far away

source: pilowi-
en_us: It is far away

source: pilwi
en_us: Far away

source: pim-
en_us: Oil, Grease, Lard, Tallow, Butter

source: pimaamihkihsen-
en_us: The earth goes along

source: pimitahaakan-
en_us: Cross

source: pimitee-
en_us: it burns past, Lake Peoria

source: pimwaakan-
en_us: ammunition

source: pinahkwaan-
en_us: Comb

source: pinepakat-
en_us: Leaves are falling

source: pinkomin-
en_us: Blueberry (Vaccinium sp.), huckleberry (Gaylussacia baccata)

source: pinkw-
en_us: Ash

source: pinkwaapow-
en_us: Lye

source: pinkwaawileni-
en_us: person of the ashes, person of Pickawillany

source: pinkwahkiw-
en_us: Dust

source: pinkwapiw-
en_us: Powder

source: pinšiw-
en_us: Cat, bobcat (Lynx rufus)

source: pinšiwa amootayi siipiiw-
en_us: Wildcat Creek

source: pipoon-
en_us: It is winter

source: pipoonahkionki
en_us: North

source: pipoonw-
en_us: Year, winter

source: pipyaaw-
en_us: Alongside, by

source: pišinsikw-
en_us: Merganser (genus Mergus)

source: poohkaanam-
en_us: Sift it, winnow it

source: poohkahaakan-
en_us: Chisel

source: poohkaham-
en_us: Make a hole in it by tool

source: poohkat-
en_us: It has a hole, keyhole

source: poohkihšiikoliaakan-
en_us: Nose ring

source: poohkihšikoli-
en_us: yoncopin, water chinquapin, American lotus (nelumbo lutea)

source: poohkikoleehw-
en_us: Pierce his nose

source: poohkišaakan-
en_us: Window

source: poohkišam-
en_us: Cut a hole in it

source: poohkohkaa-
en_us: it is pierced, it gets a hole in it

source: poohkohsiihsi-
en_us: Bobwhite (Colinus virginianus)

source: poonaahkii-
en_us: Stop throwing, stop playing lacrosse

source: poonam-
en_us: Stop it, quit it

source: poonamaw-
en_us: Give it up to him, deliver it to him

source: pooneelim-
en_us: Quit thinking of him

source: pooneelintam-
en_us: Stop thinking of it, forget it

source: pooni-
en_us: Stop, cease

source: pooni-kiišikat-
en_us: Day of the week

source: poonihsen-
en_us: The wind stops

source: poonihtan-
en_us: It stops flowing

source: pooniihkaw-
en_us: Leave him alone, quit dealing with him

source: poonikaa-
en_us: Stop dancing

source: poonikitelotaw-
en_us: Forgive him

source: poonipii-
en_us: Stop drinking

source: pooniteeheelotaw-
en_us: quit having feelings for him

source: poonwee-
en_us: Stop talking

source: poosi-
en_us: Go aboard (a boat), get into a vehicle, embark

source: pootaataakan-
en_us: Blow Pipe

source: pootaatam-
en_us: Blow on it

source: pootawee-
en_us: Start a fire

source: pwaawikamisiip-
en_us: Little Wabash River (Indiana)

source: pyaa-
en_us: He comes

source: pyaakimin-
en_us: Persimmon berry

source: pyaakimišaahkw-
en_us: american persimmon tree (Diospyros virginiana)

source: pyaalotaw-
en_us: approach him

source: -sekohs-
en_us: Aunt (father's sister)

source: -sepiinkw-
en_us: Tear

source: saahki-
en_us: crayfish, crawfish

source: saahsanti-
en_us: Lizard

source: saakaciwee-
en_us: Emerge, come into view

source: saaki-
en_us: Sprout

source: saakiiwee-
en_us: Confluence, mouth of river

source: saakiiweesiipiiw-
en_us: St. Joseph River (Lake Michigan)

source: saakiiweeyonk-
en_us: South Bend, Indiana

source: saakin-
en_us: It sprouts

source: saakipakat-
en_us: Leaves are budding, are coming out

source: saansihke
en_us: From time to time

source: saapiinkwion-
en_us: vision, foresight

source: saasakiiniwi-
en_us: Policeman

source: sakaahkwee-
en_us: Grab hold

source: sakahaakan-
en_us: Nail (metal)

source: sakahotoo-
en_us: Tie it on, fasten it

source: sakantam-
en_us: Hold it in the mouth

source: sakiin-
en_us: Grasp him, hold him, catch him

source: sakiinaakan-
en_us: Handle

source: sakiinam-
en_us: Hold it, grasp it

source: sakikansi-
en_us: Blue Ash (Fraxinus quadrangulata)

source: sakimi-
en_us: Mosquito (Culiseta longiareolata)

source: sakinteenhs-
en_us: Small Glass

source: sakinteew-
en_us: Bottle, glass, jar, vase

source: sakipitee-
en_us: It is tied fast

source: seehkwee-
en_us: weep, cry

source: seekatehkw-
en_us: Tick

source: seekih-
en_us: Frighten him, scare him

source: seekim-
en_us: Scare or frighten him by words, speech

source: seekipalwaakan-
en_us: Hair bow, hair tie

source: seekisi-
en_us: Be afraid, scared

source: seenipiikaapow-
en_us: Juice (generic)

source: seenseemin-
en_us: Plum stone (game piece)

source: seenseewi-
en_us: Play plum stone

source: sehkalwi-
en_us: Spit, slobber, drool

source: sekinaahkw-
en_us: Blackbird

source: siihsam-
en_us: Bite him

source: siihsantam-
en_us: Bite it

source: siihsantee-
en_us: Bite, bite down

source: siihsiinkween-
en_us: Scratch his face

source: siihsinam-
en_us: Scratch it

source: siihsipaahkw-
en_us: Maple Sugar

source: siihsipaahkwikaan-
en_us: Maple sugar camp, sugar shack

source: siikaahkii-
en_us: Pour out, throw out, spill

source: siikahaakan-
en_us: Batter, dough

source: siikalaan-
en_us: it drips, the sap flows

source: siikihkaa-
en_us: It spills, leaks out

source: siikinam-
en_us: Pour it (into or out of)

source: siilipiinkwee-
en_us: have one's eyes water

source: siinipiikinam-
en_us: Wring it out, squeeze the liquid out of it

source: siinitikolee-
en_us: Blow/wipe one's nose

source: siinitikoleen-
en_us: Blow / wipe his nose

source: siipiiw-
en_us: River

source: soonkaci-
en_us: To freeze

source: soonkan-
en_us: It is hard, solid

source: soonkatehki-
en_us: the ground is frozen solid

source: soonkaten-
en_us: It freezes, is frozen

source: soonkikaatee-
en_us: Have hard, firm feet

source: soonkin-
en_us: Hold him strongly, firmly

source: soonkinetii-
en_us: Hold firmly to each other, grab each other

source: soopaakisi-
en_us: Misbehave

source: soopalohpw-
en_us: Kiss him

source: swaahteethsokon-
en_us: Seven days, a week

source: -taahpahtaan-
en_us: Ring, bracelet

source: -taahs-
en_us: Sock

source: -taahsi
en_us: legging, stocking

source: -taampihkan-
en_us: chin, jaw

source: -taan-
en_us: Daughter

source: -tahkiamw-
en_us: One's enemy

source: -tay-
en_us: pet, domestic animal

source: -teeh-
en_us: heart

source: -tehkweehsim-
en_us: Husband's sister, sister-in-law (woman's term)

source: -tehs-
en_us: spleen

source: -tehtolen-
en_us: Hat

source: -teli-
en_us: Shoulder

source: -tentalem-
en_us: one's goods, possessions, things

source: -toon-
en_us: mouth, lips

source: -toontan-
en_us: Heel

source: taahsonki
en_us: On this side

source: taahtaankw-
en_us: Spotted skunk (Spilogale putorius), civet cat

source: taahtakiihšim-
en_us: lay him down

source: taahtakiihšin-
en_us: Lay down

source: taanaaha
en_us: Where about, when

source: taaninhswi
en_us: How many, how much, how far, a quantity of place or objects, time

source: taaniši
en_us: How, where to, when

source: taanonci
en_us: From where

source: taapihs-
en_us: Harness

source: taapimaawe
en_us: exclamation, be it from fear or in admiration, used only by women

source: taapinam-
en_us: Raise it up by hand

source: taatohkam-
en_us: He tears it open, bursts it

source: taatošam-
en_us: cut it open

source: taawaaw-
en_us: Ottawa person

source: taawaawa siipiiw-
en_us: Maumee River (Indiana-Ohio)

source: tahkaahsin-
en_us: It is a cold wind

source: tahkaahsitaakan-
en_us: (electric) fan

source: tahkaham-
en_us: cool it (by tool)

source: tahkan-
en_us: It is cool weather

source: tahkihsen-
en_us: It is cold to the touch, cooled off

source: tahkihsetoo-
en_us: Cool it

source: tahkihšim-
en_us: Cool him off

source: tahkili-
en_us: Be cold to the touch

source: tahkinkam-
en_us: Cold water, spring

source: tahkinkami siipiiw-
en_us: Spring river, Oklahoma

source: tahkinkamii-
en_us: It is cold water

source: tahkiteehee-
en_us: Have a cold heart

source: tahkonam-
en_us: Hold it tight, hold it firm

source: tahkwanwilookii-
en_us: Have cold skin, icy skin

source: tahkweetin-
en_us: It is cold or frozen, as of something liquid

source: tahoohtawi-
en_us: Have a cold

source: takaakan-
en_us: Axe, hatchet

source: takwaahkat-
en_us: There is frost

source: takwaaki-
en_us: It is autumn/fall

source: takwaham-
en_us: Grind it

source: tapaahsi-
en_us: Canada Goose (Branta canadensis)

source: tapaal-
en_us: Love him, have affection for him

source: tapaalintion-
en_us: Love

source: tapaatam-
en_us: Love it, appreciate it

source: tatankonam-
en_us: Clean it, clear it (by hand)

source: tatankwahki-
en_us: It is land cleared of trees

source: teehsaakan-
en_us: Base, Support, Bridge Support

source: teehsikaan-
en_us: Garage, Shed

source: teehsoon-
en_us: Scaffold, sleeping platform, shelf

source: teehtaw-
en_us: kind, type

source: teehš-
en_us: Instead of, only, rather than, except for

source: teekinaahkw-
en_us: Grackle (Quiscalus quiscula)

source: teenteekihs-
en_us: Blue Jay (Cyanocitta cristata)

source: teenti-
en_us: Killdeer, Plover (Charadrius vociferus)

source: teep-
en_us: Ability, can, enough, sufficient, stop that!

source: teepantaakan-
en_us: Barrel

source: teepapi-
en_us: Have enough room to sit

source: teepat-
en_us: It is enough, sufficient, good

source: teepatikway-
en_us: Poison Ivy

source: teepihsaa-
en_us: Be able to get at it

source: teepinaakosi-
en_us: Be worthy, have the ability to do something

source: tehkinawi-
en_us: Be in a cradleboard

source: tehtepihsaa-
en_us: Bike, bicycle

source: tehtepihsaapi-
en_us: Ride a bike

source: tekweeh-
en_us: Make him ashamed

source: tekweesi-
en_us: Be ashamed

source: tekweesihtam-
en_us: Shame it

source: tepaham-
en_us: Pay for it

source: tepahw-
en_us: Pay him

source: tepeelinkii-
en_us: Govern, run things

source: tepehkii-
en_us: It is night

source: tepilaweesi-
en_us: Own something, create something

source: tihkinaakan-
en_us: Cradleboard

source: tikaw-
en_us: A little (for activities or qualities)

source: tikwee-
en_us: Be shameful

source: tikweeyon-
en_us: Shame

source: tipahaakaanihs-
en_us: Minute

source: tipeelinkiikaan-
en_us: Tribal Office, Headquarters

source: tipeelinkion-
en_us: Government

source: tipeelintamookan-
en_us: Gift

source: tipeew-
en_us: Good, pleasing, gladly

source: tipehki kiilhsw-
en_us: Moon

source: tipilawe
en_us: of oneâs own effort, oneâs own family

source: toohkaw-
en_us: Follow him

source: toohkii-
en_us: Move, stir

source: toohkin-
en_us: Touch him

source: toohkinam-
en_us: Move it, touch it (by hand)

source: toohkiwi
en_us: softly, gently

source: toohtooleehsi-
en_us: Cricket

source: toontw-
en_us: Bullfrog (Rana catesbeiana)

source: toopalam-
en_us: It is damp, humid

source: toopalameekin-
en_us: It is damp cloth

source: toopeeli-
en_us: accomplish, succeed, finish

source: toopihsen-
en_us: It is effective, works well

source: toopihšin-
en_us: Hurt oneself falling down

source: toopim-
en_us: have someone's consent

source: toopišam-
en_us: Manage to cut it

source: toopišw-
en_us: Manage to cut him

source: toopwee-
en_us: Accomplish (by speech), persuade

source: -wiinsoon-
en_us: Name, clan

source: -wiiw-
en_us: Wife

source: waaciinkweeh-
en_us: Annoy him

source: waahkamiinkwee-
en_us: Have a clean, clear face

source: waahkw-
en_us: Fish egg

source: waahoonah-
en_us: Potawatomi person

source: waahpyaa-
en_us: Arrive here

source: waahsaaphtee-
en_us: It is overripe

source: waahsee-
en_us: It is daylight

source: waahsee-kiilhsw-
en_us: Sun

source: waakihsah-
en_us: Cause him to go in a circle

source: waakišam-
en_us: Cut it crookedly

source: waakohsee-
en_us: Walk in a circle, meander

source: waal-
en_us: Cave, Hole in the ground

source: waalantaakanisiip-
en_us: Coal River (West Virginia)

source: waalihkii-
en_us: Dig a hole

source: waalihsi-
en_us: Bullhead catfish (Ameiurus spp.)

source: waalihtan-
en_us: It is a ditch, a gully

source: waalinaakan-
en_us: Well (for water)

source: waanantakihšin-
en_us: Lay quietly

source: waanapi-
en_us: Eat something up

source: waapaahkoonseenti-
en_us: Eastern cottonwood tree (Populus deltoides)

source: waapaahšiki siipiiw-
en_us: Wabash River (northern Indiana)

source: waapaapiikw-
en_us: white ribbon

source: waapahaakan-
en_us: Soap

source: waapahsen-
en_us: Limestone

source: waapam-
en_us: Look at him

source: waapamoon-
en_us: Mirror, glass

source: waapan-
en_us: It is dawn, light

source: waapanahki-
en_us: Delaware person

source: waapanekaa-
en_us: Dance all night

source: waapanelaan-
en_us: It rains all night

source: waapank-
en_us: Tomorrow

source: waapanki-
en_us: Swan

source: waapankiaakamii-
en_us: Marais des Cygnes River (Kansas)

source: waapankii-
en_us: Observe, Look on, watch

source: waapanohsee-
en_us: Walk at dawn, in daytime

source: waapansi-
en_us: Survive till dawn, make it through the night

source: waapansw-
en_us: Rabbit

source: waapantam-
en_us: Look at it

source: waapantel-
en_us: Show something to him

source: waapantenaakan-
en_us: Candle, oil lamp, light

source: waapantenam-
en_us: Make it light, turn on the light

source: waapantw-
en_us: Mushroom (generic)

source: waapeehs-
en_us: Mussel (Unio pictorum)

source: waapeekin-
en_us: It is white cloth, paper

source: waapi-
en_us: It is white

source: waapi-kwaahkw-
en_us: Ivory Billed Woodpecker (Campephilus principalis)

source: waapi-moohsoonsa
en_us: lamb

source: waapi-moohsw-
en_us: Sheep (Ovis aries)

source: waapi-nipi siipiiw-
en_us: Whitewater River

source: waapi-paapankamw-
en_us: Arctic fox (Vulpes lagopus)

source: waapi-pakaan-
en_us: Hickory Nut (generic)

source: waapicahkihkw-
en_us: tin can

source: waapihki-moohsi-
en_us: Grub worm, borer larvae

source: waapihkilooki-
en_us: White Man

source: waapihkw-
en_us: Louse ( Fahrenholzia pinnata)

source: waapihkwee-
en_us: Have white hair, grey hair

source: waapihtank-
en_us: White Creek (Oklahoma)

source: waapikamii-
en_us: It is clear water, white water; White River West Fork

source: waapikoonahki-
en_us: There is hoarfrost

source: waapimotay-
en_us: Blanket

source: waapinkolaan-
en_us: light rain, sprinkle, drizzle

source: waapinkopakat-
en_us: Cabbage (Brasscia oleracea)

source: waapinkosita saki-
en_us: Great Blue Heron (Ardea herodias)

source: waapinkwilooki-
en_us: Elephant (Elephantidae)

source: waapipili-
en_us: Domestic farm turkey, turkey

source: waapisi-
en_us: Be white

source: waaw-
en_us: Egg

source: waawaahsamw-
en_us: Firefly (Photuris lucicrescens)

source: waawaahsinaakwat-
en_us: it is shimmering

source: waawaapaakan-
en_us: Peace Bead

source: waawaapiihkici-
en_us: Hornet (Dolichovespula maculata)

source: waawaapinkwaahkat-
en_us: White oak (Quercus alba)

source: waawaapow-
en_us: Eggnog

source: waawanihwi-
en_us: Fool around, joke around

source: waawiihkapimin-
en_us: Pear

source: waawiikapimišaahkw-
en_us: Glossy Hawthorn (Crataegus nititda), Green Hawthorn (Crataegus virdidis), Red haw (Crataegus sp.)

source: waawiinaakan-
en_us: Biscuit, bread, muffin

source: waawiipihkaa-
en_us: Do it in a hurry, go in a hurry

source: waawiipihseehki-
en_us: Collect firewood quickly

source: waawiipinkwat-
en_us: Fox grape (Vitis labrusca)

source: waawiipisi-
en_us: Hurry, be in a hurry

source: waawiyaa-
en_us: it is round

source: waawiyaak-
en_us: Circle

source: waawiyiisi-
en_us: Be round

source: waayaahkooši-
en_us: Millipede (Diplopoda)

source: waayaahtanw-
en_us: Wea person

source: waayol-
en_us: Bewilder him, confuse him

source: wanihtam-
en_us: Misunderstand something heard

source: wanihtaw-
en_us: Misunderstand what he says

source: wanim-
en_us: Fool him, trick him, cheat him

source: waninkii-
en_us: Cheat, fool, trick

source: wanipilaakii-
en_us: Forget

source: wayaakaham-
en_us: Stir it

source: wašoon-
en_us: Otoe person

source: weehki-kihkatw-
en_us: New Year

source: weekiwiteehee-
en_us: Be patient

source: weekiwiteehion-
en_us: Mindfulness

source: weekiyosi-
en_us: be careful, be slow

source: weelihpiki atoohpoon-
en_us: Coffee table

source: weelolaahkošikw-
en_us: Carpenter

source: weepin-
en_us: throw him to the ground

source: weeweehsion-
en_us: Fan

source: weeweepaham-
en_us: Swing it, rock it, cradle it

source: weeweepihsaa-
en_us: It swings

source: weeweepihsaakan-
en_us: Cradle, swing

source: weeyaakahaakan-
en_us: Spoon, ladle for cooking or stirring (generic)

source: wehkaapantani-
en_us: It looks new

source: wehkiili-
en_us: To innovate, have a new thought

source: welaahkonam-
en_us: Fold it, as clothing or skins

source: welaalaansam-
en_us: Color it, make it a color

source: welaantawee-
en_us: Climb (as in a ladder, tree, fence)

source: welaapinti-
en_us: Pull a bowstring

source: welaapoohkii-
en_us: Prepare a liquid mixture

source: welaci-
en_us: To have a chill, chills

source: welahkihtoo-
en_us: Clear it (a place), make a place clean

source: welahs-
en_us: Put him away, bury him

source: welahtoo-
en_us: Put in its place, put away

source: welenaahkii-
en_us: To spread something out, smooth something out

source: welenam-
en_us: shape it by hand

source: welešam-
en_us: Cut it into shape

source: welikaa-
en_us: Begin to dance

source: wensam-
en_us: Boil it

source: wensw-
en_us: Boil him

source: weših-
en_us: make him

source: wešihtoo-
en_us: Make it; deal it (as in cards)

source: wešihšin-
en_us: Go to bed

source: wešikii-
en_us: Build a house, pitch a tent

source: wihkiikin-
en_us: be new clothing

source: wihkiinaakwat-
en_us: It is new

source: wihkweeliihsi-
en_us: Bat (animal)

source: wiicihsaantion-
en_us: brothers and sisters, children of the same parents

source: wiiciilam-
en_us: help him

source: wiiciilantii-
en_us: Help each other

source: wiiciilwee-
en_us: Help

source: wiicikaa-
en_us: Dance in a group, crowd

source: wiicikaam-
en_us: Dance with him

source: wiicikaapaayom-
en_us: Stand with him

source: wiicikiim-
en_us: Live with him, dwell with him

source: wiicimiihkimom-
en_us: Work with him, collaborate

source: wiicinaakosi-
en_us: Be together

source: wiicinaakosion-
en_us: Being together

source: wiicipaahpim-
en_us: Joke with him

source: wiiciteeheem-
en_us: Agree with him

source: wiiciwiiyaakiteeheem-
en_us: have one's heart be happy with someone, congratulate someone

source: wiihkam-
en_us: Summon him, call him

source: wiihkapaahkwaakaniš-
en_us: Silver maple, Soft maple (Acer saccharinum)

source: wiihkapaakan-
en_us: Salt

source: wiihkapaakanaapowee-
en_us: It is salty water, water with salt mixed in it

source: wiihkapaham-
en_us: To salt something

source: wiihkapalit-
en_us: Be soured, spoiled

source: wiihkapan-
en_us: It is sweet, candy

source: wiihkapaten-
en_us: Ice cream

source: wiihkapesi-
en_us: Indian turnip, Jack-in-the-pulpit (Arisaema triphyllum)

source: wiihkat-
en_us: Don't ever

source: wiihkoowi-
en_us: Whippoorwill

source: wiihkway-
en_us: Fur cap

source: wiihkweetii-
en_us: Put on, wear pants

source: wiihkweetion-
en_us: trousers, pants

source: wiihpam-
en_us: Eat with him

source: wiihpeem-
en_us: sleep with him/her

source: wiihs-
en_us: many, much

source: wiihsakaakan-
en_us: Pepper

source: wiihsakaapowee-
en_us: it is bitter liquid

source: wiihsakan-
en_us: it is bitter, sour

source: wiihsakihšin-
en_us: Be in great pain

source: wiihsakinihkiiwaci-
en_us: Have one's hands hurt from cold

source: wiihsat-
en_us: there is a lot of it

source: wiihsikaan-
en_us: Tomb, grave house

source: wiihsini-
en_us: Eat

source: wiihsinikaan-
en_us: Dining room, dining hall, restaurant

source: wiihswaalakat-
en_us: It has many holes in it

source: wiihswakintee-
en_us: It is expensive, high priced

source: wiikapimiš-
en_us: Basswood/American Linden (Tilia americana)

source: wiiki-
en_us: dwell, stay

source: wiikiaam-
en_us: Dwelling, House, Lodge, Wigwam

source: wiikiaamintehs-
en_us: Small lodge, house

source: wiikihkaa-
en_us: Play ball game

source: wiikintii-
en_us: Marry each other

source: wiikway-
en_us: Glue (Made from deer horn)

source: wiikweehsimiš-
en_us: Paper Birch (Betula spp.), River Birch (Betula nigra), Gray Birch (Betula populifolia), Canoe Birch tree

source: wiilinw-
en_us: Fat

source: wiilinwahsen-
en_us: Quartzite, granite

source: wiilinwiihsi-
en_us: Meadowlark (Sturnella neglecta)

source: wiimp-
en_us: Bone Marrow

source: wiin-
en_us: kernel, nut meat, marrow

source: wiinaahkatw-
en_us: Spicebush (Lindera benzoin)

source: wiinaahkatwaapow-
en_us: Spicebush Tea

source: wiincinaakosi-
en_us: Belong to a certain tribe

source: wiini-
en_us: It bears fruit, nuts, marrow

source: wiinici-
en_us: Box turtle (Terrapene carolina carolina)

source: wiinihki-
en_us: Hellbender Salamander (Cryptobranchus alleganiensis), Waterdog (Ambystoma tigrinum)

source: wiinihsihsi-
en_us: Onion, Nodding wild onion (Allium cernuum)

source: wiinikoli-
en_us: Northern Flicker Woodpecker (Colaptes auratus)

source: wiinipiikw-
en_us: Winnebago person

source: wiinkan-
en_us: It tastes good, is good to eat, tasty

source: wiinkihpw-
en_us: like the taste of him, like to eat him (animate foods)

source: wiinkihtam-
en_us: Like the taste of it, like to eat it

source: wiinkimyaakan-
en_us: It smells good

source: wiinkom-
en_us: Bran

source: wiinkw-
en_us: Moth

source: wiinkwaal-
en_us: Respect him

source: wiinkweelim-
en_us: Trust him

source: wiinswi-
en_us: Be named

source: wiint-
en_us: name him

source: wiintaakan-
en_us: Book

source: wiintaakani teehsoon-
en_us: Bookshelf

source: wiintaakanikaan-
en_us: library

source: wiintam-
en_us: Call it, read it, name it

source: wiintamaakion-
en_us: notification, announcement

source: wiintamaw-
en_us: Tell it to him, instruct him

source: wiipic-
en_us: Flint

source: wiipicahkionkI
en_us: Huntington, IN

source: wiipicahsen-
en_us: Flint nodule

source: wiipihšalw-
en_us: Elderberry (Sambucus Canadensis)

source: wiipinkosi-
en_us: Be gray

source: wiipinkwaahkatw-
en_us: Post Oak tree (Quercus stellata)

source: wiipinkwalit-
en_us: Be rotten, gray

source: wiipinkwee-
en_us: It is gray

source: wiipinkweekin-
en_us: It is gray cloth, paper

source: wiitahokom-
en_us: Go in a boat with, swim with

source: wiitapim-
en_us: Sit by him, ride with him

source: wiitee-
en_us: Accompany, go together, go along with

source: wiiteem-
en_us: Accompany him, go with him

source: wiitohseem-
en_us: Walk with him

source: wiiwahol-
en_us: wrap him, bandage him, apply medicine to him

source: wiiwahosi-
en_us: Be wrapped, bandaged, swaddled

source: wiiwaš-
en_us: Saddle, pack

source: wiiwiikihšim-
en_us: Wrap him up

source: wiiyaahki-
en_us: Stay, be at, dwell

source: wiiyaakiteehee-
en_us: Happy, rejoice

source: wiiyaakiteeheem-
en_us: Make someone happy, please someone

source: wiiyoohs-
en_us: Meat

source: wiiyoohsaapitaakan-
en_us: Gums (Mouth)

source: wiiyoonkonci
en_us: Because

source: wiišaapahtoo-
en_us: Run fast

source: wiiših-
en_us: Paint on his face

source: wiišihwi-
en_us: Paint on one's own face

source: wiišiinkweeh-
en_us: Draw, paint an image of his face

source: wilaahkwahaakan-
en_us: Broad axe

source: wilenaahkihtaakan-
en_us: Carpet, rug

source: wintaapihkinaakan-
en_us: rein, steering wheel
